# -*- coding: utf-8 -*-
# author:shihua
# coder:shihua
# 这是一个数据模型混合模式类，主要功能管理计算图单个计算节点，主要技术Mixin混合技术。
"""
模块介绍
-------

这是一个数据模型混合模式类，主要功能管理计算图单个计算节点，主要技术Mixin混合技术。

设计模式：

    （1）  Mixin

关键点：    

    （1）Mixin
    
主要功能：            

    （1）管理计算图单个计算节点

使用示例
-------


类说明
------

"""



####### 载入程序包 #####################################################################################
#######################################################################################################



from cuber.model.data import *
from cuber.tool.state import *



####### 数据模型混合模式类 #######################################################################
### 功能：                                                                                    ###
### (1) 管理计算图单个计算节点                                                                  ###
### 技术：                                                                                    ###
### (1) Mixin                                                                                ###
################################################################################################



####### 数据模型管理混合类 ##############################################################################
#######################################################################################################



class DataModelMixin(DataModel,FiniteStateMachine):
    '''
    类介绍：

        这是一个数据模型混合模式类，主要功能管理计算图单个计算节点，主要技术Mixin混合技术
    '''


    def __init__(self,*args,**kwargs):
        '''
        属性功能：

            定义一个初始化方法，主要从父类集成所用功能，包括数据模型功能和有限状态机功能
        '''

        super().__init__(*args,**kwargs)



########################################################################################################
########################################################################################################


